{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v1.7.2", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "embedding_1/embeddings", "shape": [42, 48], "dtype": "float32"}, {"name": "conv1d_1/kernel", "shape": [5, 48, 192], "dtype": "float32"}, {"name": "conv1d_1/bias", "shape": [192], "dtype": "float32"}, {"name": "conv1d_2/kernel", "shape": [4, 192, 384], "dtype": "float32"}, {"name": "conv1d_2/bias", "shape": [384], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [13440, 128], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [128, 18], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [18], "dtype": "float32"}]}]}